#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "59109529b862405026ab30a212337945" -> "5a351e08a2f3193501128a51693e715b"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "786afdfc5e23db22c60e3cdce976bd29" -> "8be802a824b824867d544c7e24e5f246"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "bc6d00cd2d6ef20e5d0f044bec43317b" -> "54cfb87af3d88d8092d0145636159188"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d8a7065af7797eeccc8e1f6474a2cda9" -> "e6b91cb5a49bf0e29e56e7eade55540d"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "ce8e66d7929d3bed051db73d1336882a" -> "bb12613643f0e0593f3b37e0c6e31c40"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "8d1f4fb13d8b69d716945640695aae4c" -> "bdc51f73f52e96d60bc36e0b5c3d7340"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "640ef1d30cc8c676602d77ad43a2df24" -> "c9031cd3d2453b34dcf23c5dee29c481"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "7243ba16cfeda405a39b5a157122a431" -> "489eb553b39abc667a456b98618332df"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "183ed4596bce81a9d1b0706ec05b2707" -> "090ce719a107d5118bed810eaf7f4492"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "0f4705f5c47bb28ecd25d1d5911e7fbf" -> "aee9a5a4180a0410d9064a73804e1180"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "24447e3c0ef8c03862445f4903e53c97" -> "c1624d48f674f6f266247313d2701e0f"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "d20b0be2832af54fb8c780b5df0ec8d0" -> "b27f5ab4b7f49901a2ad543eb6af194b"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "42943f032cda67ff70ec103f7eff6822" -> "5863896a446e60c5e5a226fc04d134d6"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "9eb0bc7abb1305fcce24c794c0d93106" -> "37333fb9adcfee9c5d7802ce07e1cddc"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "ebb647ba701ae70603275d7d3705e3b3" -> "3517abe1d6f8d32a7a43c374e71fcfae"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "fd670b88e6d400d4e5106e22bdf9b681" -> "dc83400f7baa487b1cf430b8fbfb4ca0"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "0386cc15e103c255d1e497db5e5d470e" -> "f2cf1f55c821aee6405649157a4292c4"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "be4cd198f204f6dfdc7f79103a6550fb" -> "d3e058f3cbbbb2386e2829c730c5a3d2"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "df53a95efdc4752a3d259d7ad2ce2f52" -> "53d368920d7ae02f536a9c1622d811b1"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "8bbc7213914231237e3cb8a6ddb0c637" -> "e71c413b3c53d9fc7b1a3d7a939c4549"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "7f477898286c1c9d99e04018c9734635" -> "e31dfd3b5cd76cc38fe42647891c46c9"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "b3eb58e90b2bc5d259d9500d75581d0e" -> "be3a493fb99452d2ea7a532af21dbcea"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "9172ed92b557543afb85d7b494e66389" -> "785837e8a981946fbdd4bd2bbabc9cd3"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "f82782064b776f5002981133805ed64c" -> "c94f997e33bf6ba77774e014de6bf1d8"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "9788ff6d2a0acf4ab10ee94fde39b897" -> "a4f9e518d4b75a1328e2e7dc8587e9b1"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "03e1e9a10ea957801e7018fc347b0928" -> "9a0c53ce9a215e665dd4ea765151a726"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "153794310a7533ac14603649f0efcf56" -> "97cb4e14ba1052b49a5e5d6aa8f95f0e"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "bffb163b6cadf2caef714c42f78b2771" -> "589c12abd1799f572b778852b260b5c4"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "fdd82b856b9ab1a7dc04a61c939503fa" -> "fc0bac8ad9d96ed5f62cc017f205e914"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "0c81b05a67d63b7e74331bfc7e39e4ba" -> "b3f3d5b4711b4a7424bd804295f598d8"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "b653cf6c8be483286da4a68dff4406c1" -> "4b0a56c8551c348aa03a46075334a3fc"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "0c3845ef2cf149f4ddaadde56818c310" -> "36c23328850b1774d0563935cd3488f7"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "4dab210569d0cdea4c341bf5d468b6f2" -> "1d3ce24c18a66e5af1ccea7822d7c908"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "1c76021e4b9f2acc5357abab82e0896e" -> "7caa6066485e9ad023beee79618ef41a"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "4fd3d4974ddcee3a3299873520e1b1a5" -> "de2cf431e2e83adb1d609c24f225d354"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "bc272945b588d69a731b9f0f1fac5a06" -> "cd4a10c0ee7290b3e22ac0385074594f"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "e9721a7ae621d772e52c529a73dbaeef" -> "8713ec61b599494669e10329458b5221"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "826cc90e0e174f700a8631ffddcb7bb3" -> "7c844a717c5481282dc4821485fc69bd"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "67bd988e9bd93d734e50df14a6613566" -> "85f552152c2a81b1779ed63da9d6edd5"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "a90fe34b6a1a7937e76e2c73a454cee4" -> "a36485e84ef95c80328b6fbe5ad6da38"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "de7a6f2d947b9e405f8ae44ffe88f70f" -> "73c6ab5fbfba9df96580c9a60fb2a756"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "02185a01236ba10490afa6e8c3d33e24" -> "c773d0c04c6b89289a8f4808a27def19"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "cf91d98537a20fceedc6e8ca0964fba4" -> "b4a4f8f864eae0eab7cf1522c9df4130"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "3cfddd7419887b8dc1aa3fbd79cc2e7e" -> "421ce8b93c6bc82f44657887241ae024"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "688a2fcce0ca4ddea38fb64913fdcf69" -> "6142463b4ea11e063a821444f66a7e34"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "5a7785e5ce20354666bd0b1bdef918fe" -> "88a7b72e20d2d80ef058e420de0cc59e"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "7b23273347bc213cb703c5a7ee5f4a43" -> "c3d01cd83e1ff78f73348c10195d3563"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "sCoikEC30zvJMt1/fCPQb2iFxpmSFBPEBDnZlxTwXSo=" -> "t0nR55hQuDCk2cqJdv+640Lr564l1i2P3lpCC0p1760="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "JiD2k6IcPCKtaouMcFIxa5W7itysuz5oU7p6YSxxJzM=" -> "xVClf51IBJhFC/EFTERJ2m+MJNrbjE3WeGB7TN41b2c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCuH9F3lFVh7q7bG48HfVjAWJwDVKJ6sfHZwr1Tdd74=" -> "k9WjPe71mIBGIa3D8zDKsfiJzDzna9AsoqejYqPj5fo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "38p1DgXoHWHdvNYCaWxi73oWcA/HuyOVkIT5oEAUA48=" -> "FO+1yotd6SZR3RYp69ieIEEBvHUkRlUFo6Rx1o2qewM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvkQC5ijMEO53xTeMPnDmHdxom2r8LpxJOWiHteT4Yo=" -> "HCWwNACQxCZc85/DUCjChZQiTJMuYnNPL62UjS8ZTwQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWZFICI16Mmnitls4oICL9gJGxRmHUbtdIA2WMb+yt8=" -> "iB0BsEs/B/TjKXZ0mUI5Ep8KTQ+wzkPteCAfTCyHB80="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWjIrj+RRvnfUL1FDgQca3zatoqvyji7stfgatWySj0=" -> "imMPjS7hmKKSFuHEbAPI8Knvs1K6AOKbPZYXlqBMdy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "c8+fyGXo6On9CVDsENNC3DzLE3hqtVuAuwwIsaEaa6c=" -> "FoAm8kzk5HfuEH/9a1YCE9x2JOXWMlekK78VMDHImz0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yKvHYEcpKRSyX7rnGyF6B7IGKoh+vdltaGY3rpcqdKo=" -> "MxJDZ5RDxDFb8la7RmUhxpY9ugoJjOCNVwDsPPdkdYY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "qojgTDYT6Ub0KKt7905ehhRw0KkOarA8RoWyHnBd+vA=" -> "e1HX1utpuuKkD+08xinuUajLqDB/FHRJha5OUSjLmKk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ2dZzrcamyTXC7o9acgxyKCTewbdB56Mdd2+BwyQ/8=" -> "mR7A846TYx5OWNjRE/HpZejg9ZEdeVOR16XHyFZoxUQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GiMO4XimdCmYkQt8vfTM4REHKSLRKCQGTU9OQqTjn0=" -> "FQl9ZKGjJ7TInH2N0+QC9UUYWEE8sojl+o8Y6cDWseE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ3TypB3WSmN22FAI2IZqF7nTNfSEAmDtEti/alRq+I=" -> "3bgKnMqa5a3SDoRfvgS8tPObe3hlBuY+86qVUJGn1bU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "p7tKz+J81GNbBZ5DFM816T6q3O6k4PdeYnNKLYTNojs=" -> "WXqlzKQ1DPDHkCrU/1Zu+71Zkp14bEsN8fCWE8yCPIM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "/xyE9vXplVnn/dG+DDp4h7H2h2m6ERMh7g0fI17N2Hc=" -> "pn+5NuGcrjWJJMr8hNw1QVTIH+EMmQuYAh0AxBZg4FE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "xa/302K44/xgMEo/c7iW79y+8xTh+jf6cjxrzCVXohc=" -> "afOsiAWaz84K1W9F/TMecd5mWbdokJFbgF6pPBB/8jA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xp4m5RykDHlvFYKP774h1NMLN1WdUcTXaWZPopu2B/Q=" -> "oN8NGPe86GbjmKnZTTyqcWTP5uXqDD9zSk5bB3kmoe8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "FofZCyh15v+D3Ezz1gbtARiSATUmk0fluwfzsw9BoX0=" -> "CMVdn087G7ayTONjSltgUIhW1mM4keW89eWWERcxxdE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "UUcCiNdh6txDzYU/A5vM9tmVCd5WAPOBOjxGDBaEvHc=" -> "8IXeE0L48g3WXdkOCB3ERkdKezNz3kEcud1A8QJ6CCw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:34:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "2KOgushnSteholebq0lNY95fEqJvutNKhwLiScwreRw=" -> "PUNz/pFInSldbsYbk3dMlMBmk+86DWEJeip/XW+d49Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "C7K82XGHsQachb5phRs+jwGr/BriEG8/M6c2zFYg1Io=" -> "3hMGZl12AMNWI5JlBWjoxlexqOVQA8GRDkH5Qp9o6M4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "RuBPGp+2SuMbTRSVt9Smj1gmVjKyZDLn3cQeMH1vY+c=" -> "mlKRzHYKAR0e2KHVM7E4nG8hlM6VIFntJ+yz53o47q8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "GEe0ku9n4Osbe6BbfAoT5fpe/3SzzxKBcGWDeu6iyko=" -> "ZQaOtVUwDOXC5mWvepaSxtQGyERYzoJ7zU4DJ+1E/gY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "SH01WAsAaKusxQXaoOG6TikVVzCHCijE4C+xfcAHpWU=" -> "cy1L4o99uNj/LOUpTfg8pGfh7ZQmIQdmFaw07vT+QO0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "BbbEesoy20k7RNHw/kC4rpml+rCef/bpY+nsqdUcR4w=" -> "lj2ME1WMN2ix3PaT2s/LHStbBI6o0ftDaWwgUZNw+V8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:50:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "7lec+69anKp+qySn71v4lYZExCLquN/6gek4R0VPEO4=" -> "CrqXVHdkHdcRp1XWVjZW2eDz5Xm82JIpgiE8BgUpd9I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ca7VqEBRd1sG8L+24gex6ElrC1rZneDTCuguZG+H2hY=" -> "pm59Psu4WvnSZt58bUA/Ug+pOyXd+mHqmeOM+odCnFw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JWHxTlg5Q+Z+R2LZrT3qqWgXn0+WfWbYe6Zlwsvvrlw=" -> "1piAMzlrLhE73UqqLtmLtf+LupcXI+w0CU97OXHF/hM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:40:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "FzOz6jOnS4O7JoKkeXcAvZorfBUo1oJbyYvkIDZy6Gw=" -> "SWNhjqgu56DI9gW5Z+AtRadQY4h5PLUs8PRhEnG4GD8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "s1jtTsgLy8BLv6GdDOREYLMASbYG5U9WKaoYKl8ECkE=" -> "x1rP16EHYhQWHCPuTAmM6Fj4dcrJUdK2EL54o+VBKCE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-24T15:06:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "qpI3Vz64P8/c37UTxDqgNO077hdAroDakRaXOdPp9o0=" -> "h2PhdNaRL4oqX6bgw35JUIKs9R91/0zcr57QLxs0nCk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "YckJBSVlrHUF9UtqxJRUYxsLU7rvpsNsy9Wiy/RiXtA=" -> "QLxZQKBfIHDX+YOI5XC3U2cG78BpnyXgwbIMhN0NPTs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "alVJxTV2UeyfGMInaIxRmlO7TF7dO1UcOsT+TKCeMhc=" -> "WfMuWGJY3IGOIk68eInWt+y/3LpFL5hjfpaL8L8XcIw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGmehOTAedxtpxhdFrfmTMUNGNKV2Lp/rkYdv0R+nI=" -> "HnSEeFUAkWj7Dy2bCG14rEHpX3W3iQ4zbV7iwFWwYeg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOkK10OtJWgsmxfz9CyYLuYJjxahZGDWBZYIh5cnjZA=" -> "rWC9a2inTVl2m0mhfl0mC9yMsp68oovA0+SwQh5ZHbM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BryM2VMY//KXPI3EEH2wI2gLXF4tH0r6o+EyM9Der8s=" -> "0+G5E++tngmTkMW+kymcBc9cARUkE2xyK//RAae3hMc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "PbcWe7E7x1wr9o/AJsWFMaTtAOTHyNulY3qJrpWAut0=" -> "8Atmrvm4NkOdbaOG5PP8IA8IuzxAmWn3FPruQXPmYIU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "vVA+iG7OQml6x7DcX1LmzbdC65UGazOKOUa1EIrm96s=" -> "pEMaBS1YVhpO0xd6cTGcAFZ9wPkNOvXmyY3Rebn0MEM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "CUGIJeH8habHelQZRnOsdcguCCd9gDJwqrw54ECUmr4=" -> "5XYHlcvwo/8QKkt1a9CJA0Ig/64fkC6+UZgtGaiFcDk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "iJGpKfKBl+g8pnQwU/Kk9Q1w4wVjK/ngzIcqQQS2bXw=" -> "6HsPXZ/r2DZTvpc1xgnFoGzl8UXrd/ooMol8K1wBnQs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "t1seLdabUX3/GrwSkeDP8iEQhKwxT9ZqSnAvuiVHQCE=" -> "8a+BBXOxk8KL4lbtQSR4n8/cBErKH579eeIx84kzcSk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZPb0rkNMduUtZTNn/LVoocUtJddONklR07wYXGiSmA=" -> "KVO0vx5A9FWOONNl+4X1wmweaGw59PfEQyNe+FIj3YY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2s+HdSlOcREm2D4nc3bProI1iDwON1DVe08x0BR2Ow=" -> "eO5mKvBXaQgBRJ6DVxSry5DvLknGiTrCPoQ2/Y5gw9Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "vKAgt2/WRVYqi+8/QYFrI1lMaLjJqGhw+kxNapAYJV4=" -> "tYBorYHsGA4EwAu//3HIhTzkau4CtTINna0+EeE2L+Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ehKYQXHsw3KWgfz6nWFXs/NeTJlz3xbCnPg+n61pNmg=" -> "bSmMRR2SsKa+qLXz7iWyZa/RxGk4FXHA0SSjJX4dr6s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "64Xsh0e/Kv90AgznN7CuKYLYv8KNYLpk+2CFGHm/A74=" -> "to7fkyEsDQupL0mbrbSirENarNu7iFLb63QsiJzQ2Rk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-17T14:53:29Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7xufwb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*